Please write a DELETE statement and DO NOT write a SELECT statement.
Write your MySQL query statement below

```
DELETE p1 FROM Person p1, 
    Person p2
WHERE p1.Email = p2.Email AND p1.Id > p2.Id
```

Write an SQL query to fix the names so that only the first character is uppercase and the rest are lowercase.


```
SELECT user_id, 
    CONCAT(UPPER(LEFT(name, 1)), LOWER(SUBSTRING(name, 2))) AS name
FROM Users
ORDER BY user_id
```

Write an SQL query to find for each date the number of different products sold and their names.

```
# Write your MySQL query statement below
SELECT sell_date, COUNT(DISTINCT product) as num_sold, 
    GROUP_CONCAT(DISTINCT product) as products
FROM Activities
GROUP BY sell_date
```

Write your MySQL query statement below

Write an SQL query to report the patient_id, patient_name all conditions of patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix

```
SELECT patient_id, patient_name, conditions 
FROM Patients 
WHERE conditions LIKE 'DIAB1%' or conditions LIKE '% DIAB1%'
```

Employees With Missing Information


```
SELECT employee_id FROM Employees
WHERE employee_id NOT IN (SELECT employee_id FROM Salaries)

UNION

SELECT employee_id FROM Salaries
WHERE employee_id NOT IN (SELECT employee_id FROM Employees)

ORDER BY employee_id
```

Write an SQL query to rearrange the Products table so that each row has (product_id, store, price). If a product is not available in a store, do not include a row with that product_id and store combination in the result table.


```
SELECT product_id, 'store1' as store, store1 as price
FROM Products
WHERE store1 IS NOT NULL

UNION

SELECT product_id, 'store2' as store, store2 as price
FROM Products
WHERE store2 IS NOT NULL

UNION

SELECT product_id, 'store3' as store, store3 as price
FROM Products
WHERE store3 IS NOT NULL

ORDER BY product_id
```

Each node in the tree can be one of three types:

"Leaf": if the node is a leaf node.
"Root": if the node is the root of the tree.
"Inner": If the node is neither a leaf node nor a root node.
Write an SQL query to report the type of each node in the tree.

Return the result table ordered by id in ascending order.

```
# Write your MySQL query statement below
SELECT id AS Id,
CASE
    WHEN Tree.id = (SELECT atree.id FROM Tree atree WHERE atree.p_id IS NULL) THEN 'Root'
    WHEN Tree.id IN (SELECT atree.p_id FROM Tree atree) THEN 'Inner'
    ELSE 'Leaf'
    
    END AS Type
    
FROM Tree
    
ORDER BY Id;
```

Write an SQL query to report the second highest salary from the Employee table. If there is no second highest salary, the query should report null.

```
SELECT
    (SELECT DISTINCT Salary

    FROM Employee

    ORDER BY Salary DESC

    LIMIT 1 OFFSET 1) AS SecondHighestSalary
```

Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.



```
SELECT firstName, lastName, city, state

FROM Person

LEFT JOIN Address

ON Person.personId = Address.personId
```


```
# Write your MySQL query statement below
SELECT DISTINCT author_id AS id
FROM Views
WHERE author_id = viewer_id
ORDER BY id
```

Write an SQL query to find all dates' Id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

```
SELECT weather.id
    FROM weather
    JOIN weather w ON DATEDIFF(weather.recordDate, w.recordDate) = 1
    WHERE weather.temperature > w.temperature
    
```

Write an SQL query to report the names of all the salespersons who did not have any orders related to the company with the name "RED".



```
SELECT S.name 
FROM SalesPerson S
WHERE
    S.sales_id NOT IN (SELECT Orders.sales_id FROM Orders LEFT JOIN 
                      Company ON Orders.com_id = Company.com_id
                      WHERE Company.name = 'RED')
```


Write an SQL query to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

```
# Write your MySQL query statement below
SELECT activity_date AS day, COUNT(DISTINCT user_id) as active_users
FROM Activity
WHERE DATEDIFF('2019-07-27', activity_date) < 30 
AND DATEDIFF('2019-07-27', activity_date) >= 0
GROUP BY activity_date
```

Write an SQL query that will, for each date_id and make_name, return the number of distinct lead_id's and distinct partner_id's.



```
# Write your MySQL query statement below
SELECT date_id, make_name, COUNT(DISTINCT lead_id) AS unique_leads, COUNT( DISTINCT partner_id) AS unique_partners
FROM DailySales
GROUP BY date_id, make_name
```

Write an SQL query that will, for each user, return the number of followers.

Return the result table ordered by user_id.

```
# Write your MySQL query statement below
SELECT user_id, COUNT( DISTINCT follower_id) AS followers_count
FROM Followers
GROUP BY user_id
```

Write an SQL query to find the customer_number for the customer who has placed the largest number of orders.



```
# Write your MySQL query statement below
SELECT customer_number
FROM Orders
GROUP BY customer_number
ORDER BY COUNT(*) DESC
LIMIT 1;
```

Write an SQL query to report the first login date for each player.
Return the result table in any order.



```
# Write your MySQL query statement below
SELECT player_id, MIN(event_date) AS first_login
FROM Activity
# WHERE MIN(event_date)
GROUP BY player_id
```

Write an SQL query to report the latest login for all users in the year 2020. Do not include the users who did not login in 2020.

```
SELECT user_id, MAX(time_stamp) AS last_stamp
FROM Logins
WHERE time_stamp BETWEEN '2020-01-01 00:00:00' AND '2020-12-31 23:59:59'
GROUP BY user_id
```

Write an SQL query to calculate the total time in minutes spent by each employee on each day at the office. Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.

```
# Write your MySQL query statement below
SELECT event_day AS day, emp_id, SUM(out_time - in_time) AS total_time
FROM Employees
GROUP BY day, emp_id
```

Write an SQL query to report the Capital gain/loss for each stock.

The Capital gain/loss of a stock is the total gain or loss after buying and selling the stock one or many times.

Return the result table in any order.



```
# Write your MySQL query statement below
SELECT stock_name, 
SUM(CASE
   WHEN operation = 2 THEN -1*price
   ELSE price END) AS capital_gain_loss
FROM Stocks
GROUP BY stock_name
```

Write an SQL query to report the distance traveled by each user.

Return the result table ordered by travelled_distance in descending order, if two or more users traveled the same distance, order them by their name in ascending order.

```
# Write your MySQL query statement below
SELECT U.name, IFNULL(SUM(distance), 0) AS travelled_distance
FROM Users U
LEFT JOIN Rides R ON U.id = R.user_id
GROUP BY U.name
ORDER BY travelled_distance DESC, U.name
```

Write an SQL query to find for each user, the join date and the number of orders they made as a buyer in 2019.


```
SELECT U.user_id AS buyer_id, U.join_date, 
COUNT(O.order_id) 
 AS orders_in_2019
FROM Users U
LEFT JOIN Orders O
ON U.user_id = O.buyer_id AND O.order_date BETWEEN '2019-01-01' AND '2019-12-31'
GROUP BY U.user_id

SELECT U.user_id AS buyer_id, U.join_date, 
COUNT(O.order_id) 
 AS orders_in_2019
FROM Users U
LEFT JOIN Orders O
ON U.user_id = O.buyer_id AND YEAR(O.order_date) = 2019
GROUP BY U.user_id
```

Write an SQL query to report all the duplicate emails.


```
# Write your MySQL query statement below
SELECT email as Email
FROM Person
GROUP BY email HAVING COUNT(id) >  1


# Write your MySQL query statement below
SELECT Email FROM
(SELECT email as Email, COUNT(id) AS num
FROM Person
GROUP BY email) AS TEMP
WHERE num > 1
```

Write an SQL query to delete all the duplicate emails, keeping only one unique email with the smallest id. Note that you are supposed to write a DELETE statement and not a SELECT one.

```
# Please write a DELETE statement and DO NOT write a SELECT statement.
# Write your MySQL query statement below

DELETE P1 FROM Person P1, Person P2

WHERE P1.email = P2.email AND P1.id > P2.id



# Please write a DELETE statement and DO NOT write a SELECT statement.
# Write your MySQL query statement below
DELETE FROM Person WHERE id NOT IN
(SELECT * FROM
(SELECT MIN(id) FROM Person GROUP BY email) AS P)
```

Write a SQL query for a report that provides the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.



```
# Write your MySQL query statement below
SELECT actor_id, director_id
FROM ActorDirector 
GROUP BY actor_id, director_id
HAVING COUNT(timestamp) >= 3
```

Write an SQL query to report the name and balance of users with a balance higher than 10000. The balance of an account is equal to the sum of the amounts of all transactions involving that account.

```
# Write your MySQL query statement below
SELECT U.name AS name, SUM(T.amount) as balance
FROM Users U
LEFT JOIN Transactions T
ON U.account = T.account
GROUP BY U.name HAVING balance > 10000
```

Write an SQL query that reports the products that were only sold in the first quarter of 2019. That is, between 2019-01-01 and 2019-03-31 inclusive.

```
# Write your MySQL query statement below
SELECT P.product_id, p.product_name
FROM Product P
INNER JOIN Sales S ON P.product_id = S.product_id
WHERE 
P.product_id not in (
SELECT DISTINCT product_id FROM Sales WHERE sale_date 
    NOT BETWEEN '2019-01-01' AND '2019-03-31'
) 


# Write your MySQL query statement below
SELECT p.product_id, p.product_name
FROM Product AS p
INNER JOIN Sales AS s
WHERE p.product_id = s.product_id
GROUP BY s.product_id
HAVING SUM(CASE WHEN s.sale_date BETWEEN '2019-01-01' AND '2019-03-31' THEN 0 ELSE 1 END) = 0;
```


Write an SQL query to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

```
# Write your MySQL query statement below
select employee_id, 
case when employee_id % 2 = 1 and name NOT LIKE 'M%'
then salary
else 0
end as bonus
from Employees
ORDER BY employee_id
```

Write an SQL query to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.

Note that you must write a single update statement, do not write any select statement for this problem.



```
# Write your MySQL query statement below
UPDATE salary set 
sex =
case
    when sex = 'm' then 'f'
    else 'm' end
```

Write an SQL query to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

```
# Write your MySQL query statement below
select user_id, 
concat(upper(substring(name, 1, 1)), lower(substring(name, 2))) as name
from users
order by user_id
```

Write an SQL query to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

```
# Write your MySQL query statement below
select sell_date, count(distinct product) as num_sold, group_concat(distinct product) as products
from activities
group by sell_date
```

Write an SQL query to report the patient_id, patient_name all conditions of patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix

Return the result table in any order.



```
# Write your MySQL query statement below
select patient_id, patient_name, conditions
from patients
where conditions like 'DIAB1%' or conditions like '% DIAB1%'
```

Write an SQL query to report the IDs of all the employees with missing information. The information of an employee is missing if:

The employee's name is missing, or
The employee's salary is missing.

```
# Write your MySQL query statement below
select employee_id from Employees
where employee_id not in (select employee_id from salaries)

union 

select employee_id from Salaries
where employee_id not in (select employee_id from Employees)

order by employee_id
```

sales analysis

```
with sales_avg AS (
	select r.name as region, 
    case when sum(ifnull(s.amount,0)) = 0 then 0
    else sum(ifnull(s.amount,0))/count(distinct e.id) end as average


	from regions r
	left join states st on r.id = st.regionid
	left join employees e on st.id = e.stateid
	left join sales s on e.id = s.employeeid
	group by r.id, r.name)
 
 select region, average, (select max(average) from sales_avg) - average as difference
 from sales_avg
group by 1
```

Write a query that selects the item name and the name of its seller for each item that belongs to a seller with a rating greater than 4. The query should return the name of the item as the first column and name of the seller as the second column.

```
-- Write only the SQL statement that solves the problem and nothing else
select i.name as item_name, s.name as seller_name
from items i 
left join sellers s 
on i.sellerId = s.id
where s.rating > 4
```

Write a query that selects userId and average session duration for each user who has more than one session.

```
-- Write only the SQL statement that solves the problem and nothing else
select userId, avg(duration)
from sessions
group by userId having count(userId) > 1
```

Modify the provided SQL create table statement so that:

Only users from the users table can exist within users_roles.
Only roles from the roles table can exist within users_roles.
A user can only have a specific role once.

```
-- Modify only this SQL create table statement and nothing else
CREATE TABLE users_roles (
  userId INTEGER NOT NULL,
  roleId INTEGER NOT NULL,
  FOREIGN KEY(userId) REFERENCES users(id),
  FOREIGN KEY(roleId) REFERENCES roles(id),
  PRIMARY KEY(userId, roleId)
);
```

###using rank and partition by with over
Write an SQL query to report the device that is first logged in for each player.

```
# Write your MySQL query statement below
select player_id, device_id from
(select player_id,device_id, rank() over(partition by player_id order by event_date asc)
as rank1 from activity) as V
where rank1 = 1

```

Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

```
# Write your MySQL query statement below
select p.firstname, p.lastname, a.city, a.state
from Person p
left join Address a
on a.personId = p.personId
```


Write an SQL query to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.

Return the result table sorted in any order.

```
# Write your MySQL query statement below
select v.customer_id, count(ifnull(t.transaction_id, 0)) as count_no_trans
from Visits v
left join Transactions t
on t.visit_id = v.visit_id
where t.transaction_id is NULL
group by v.customer_id
```

Write an SQL query to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.

```
# Write your MySQL query statement below
select author_id id
from Views
where author_id = viewer_id
group by author_id
order by author_id
```

Write an SQL query to find all dates' Id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

```
# Write your MySQL query statement below

select a.id 
from Weather a
join Weather b
on datediff(a.recordDate, b.recordDate) = 1
where a.temperature > b.temperature
```

Write an SQL query to report the names of all the salespersons who did not have any orders related to the company with the name "RED".

Return the result table in any order.

```
# Write your MySQL query statement below

select name from
(select s.name, group_concat(ifnull(c.name, 'no_value')) as comp from
SalesPerson s
left join Orders o
on o.sales_id = s.sales_id
left join Company c
on c.com_id = o.com_id
group by s.name) as temp

where comp not like 'RED%' or comp not like '%RED%'
```


Write an SQL query to report the names of all the salespersons who did not have any orders related to the company with the name "RED".

Return the result table in any order.
```
# Write your MySQL query statement below

select s.name from
SalesPerson s

where s.sales_id not in

(select o.sales_id from Orders o
 left join Company c
 on c.com_id = o.com_id
 where c.name = "RED"
)
```

### recursive SQL first unterstanding



```
CREATE TABLE employees (
	staff_id INT PRIMARY KEY,
	manager_id INT,
	FOREIGN KEY (manager_id) REFERENCES employees (staff_id)
);

insert into employees values(1, null);
insert into employees values(2, null); 
insert into employees values(3, 1);
insert into employees values(4, 7);
insert into employees values(5, 1);
insert into employees values(6, 5);
insert into employees values(7, 6);
insert into employees values(8, 3);
insert into employees values(9, 4);

-- select * from employees;
-- select manager_id, group_concat(employee_ids)

-- from

-- (select manager_id, count(staff_id) as total_employees, group_concat(staff_id) as employee_ids
-- from employees
-- where manager_id is not null
-- group by manager_id)

-- where manager_id = employee_ids


with temp1 as
(
    select staff_id, manager_id, 0 as level_number
    from employees
    where staff_id = 1
    
    union all
    
    select a.staff_id, a.manager_id, level_number + 1 
    from employees a
    join temp1 b
    on a.manager_id = b.staff_id
)

select 1 as staff_id, (count(*) - 1) as total from temp1;


with temp2 as
(
    select staff_id, manager_id, 0 as level_number
    from employees
    where staff_id = 2
    
    union all
    
    select a.staff_id, a.manager_id, level_number + 1 
    from employees a
    join temp2 b
    on a.manager_id = b.staff_id
)

select 2 as staff_id, (count(*) - 1) as total from temp2;
```

Write an SQL query to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

Return the result table in any order.

```
# Write your MySQL query statement below
select activity_date as day, count(distinct user_id) as active_users
from Activity
where datediff('2019-07-27', activity_date) < 30 and datediff('2019-07-27', activity_date) >= 0
group by activity_date
```

Write an SQL query that will, for each date_id and make_name, return the number of distinct lead_id's and distinct partner_id's.

Return the result table in any order.

```
# Write your MySQL query statement below
select date_id, make_name, count(distinct lead_id) as unique_leads, count(distinct partner_id) as unique_partners
from DailySales
group by date_id, make_name
```

Write an SQL query that will, for each user, return the number of followers.

Return the result table ordered by user_id.

```
# Write your MySQL query statement below
select user_id, count(follower_id) as followers_count
from Followers
group by user_id
order by user_id
```

Write an SQL query to report the nth highest salary from the Employee table. If there is no nth highest salary, the query should report null.

The query result format is in the following example.

```
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
  RETURN (
      # Write your MySQL query statement below.
     select salary from
      (select salary, row_number() over(order by salary DESC) as rn
      from Employee group by salary) temp
      where rn = N
      
  );
END
```

Write an SQL query to find the customer_number for the customer who has placed the largest number of orders.

The test cases are generated so that exactly one customer will have placed more orders than any other customer.

```
# Write your MySQL query statement below
select customer_number from Orders
group by customer_number
order by count(customer_number) DESC
limit 1
```

Write an SQL query to report the first login date for each player.

Return the result table in any order.

```
# Write your MySQL query statement below
select player_id, min(event_date) as first_login
from Activity
group by player_id
```

Write an SQL query to report the latest login for all users in the year 2020. Do not include the users who did not login in 2020.

Return the result table in any order.

```
# Write your MySQL query statement below
select user_id, max(time_stamp) as last_stamp from Logins 
where year(time_stamp) = 2020
group by user_id
```

Write an SQL query to calculate the total time in minutes spent by each employee on each day at the office. Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.

Return the result table in any order.

```
# Write your MySQL query statement below
select event_day as day, emp_id, sum(out_time - in_time) as total_time 
from Employees
group by event_day, emp_id
```

Write an SQL query to rank the scores. The ranking should be calculated according to the following rules:

The scores should be ranked from the highest to the lowest.
If there is a tie between two scores, both should have the same ranking.
After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.
Return the result table ordered by score in descending order.

The query result format is in the following example.

```
/* Write your T-SQL query statement below */

select score,
dense_rank() over(order by score DESC) as rank

from Scores
```

Write an SQL query to report the Capital gain/loss for each stock.

The Capital gain/loss of a stock is the total gain or loss after buying and selling the stock one or many times.

Return the result table in any order.

```
# Write your MySQL query statement below

select stock_name, sum(stock_price) as capital_gain_loss
from
(select stock_name, 
case
    when operation = 'Buy' then -1*price
    else price end 
    as stock_price
from Stocks) as temp
group by stock_name
```

Write an SQL query to report the distance traveled by each user.

Return the result table ordered by travelled_distance in descending order, if two or more users traveled the same distance, order them by their name in ascending order.

```
# Write your MySQL query statement below
select u.name, sum(ifnull(r.distance, 0)) as travelled_distance
from Users u
left join Rides r
on r.user_id = u.id
group by u.id
order by travelled_distance DESC, u.name
```

Write an SQL query to find for each user, the join date and the number of orders they made as a buyer in 2019.

Return the result table in any order.

```
select u.user_id as buyer_id, u.join_date as join_date, count(o.order_id) as orders_in_2019
from Users u
left join Orders o 
on o.buyer_id = u.user_id and year(o.order_date) = 2019
group by user_id
```

Write an SQL query to find all numbers that appear at least three times consecutively.

Return the result table in any order.

```
# Write your MySQL query statement below
select distinct n1.num as ConsecutiveNums
from Logs n1, Logs n2, Logs n3
where
n2.id = n1.id - 1
and n3.id = n2.id - 1
and n2.num = n1.num
and n3.num = n1.num
```

Write an SQL query to report all the duplicate emails.

Return the result table in any order.

```
# Write your MySQL query statement below
select email as Email
from Person
group by email having count(id) > 1
```

Write a SQL query for a report that provides the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.

Return the result table in any order.

```
# Write your MySQL query statement below
select actor_id, director_id from ActorDirector
group by actor_id, director_id having count(timestamp) >= 3
```

Write an SQL query to report the name and balance of users with a balance higher than 10000. The balance of an account is equal to the sum of the amounts of all transactions involving that account.

Return the result table in any order.

```
# Write your MySQL query statement below
select u.name, sum(t.amount) as balance
from Users u 
left join Transactions t
on t.account = u.account 
group by u.account having balance > 10000
```

Write an SQL query that reports the products that were only sold in the first quarter of 2019. That is, between 2019-01-01 and 2019-03-31 inclusive.

Return the result table in any order.

```
# Write your MySQL query statement below
select product_id, product_name
from
(select p.product_id product_id, p.product_name product_name, s.sale_date 
from Product p
left join Sales s
on s.product_id = p.product_id
where sale_date between '2019-01-01' and '2019-03-31'
group by p.product_id) as temp
where product_id not in (select product_id from Sales where sale_date < '2019-01-01' or sale_date > '2019-03-31')
```

Write an SQL query to report the number of calls and the total call duration between each pair of distinct persons (person1, person2) where person1 < person2.

Return the result table in any order.

```
# Write your MySQL query statement below
select 

    case when from_id < to_id then from_id else to_id end as person1,
    case when from_id < to_id then to_id else from_id end as person2,
    
    count(duration) as call_count,
    sum(duration) as total_duration
    
from Calls
group by person1, person2
```

Write an SQL query to find the average selling price for each product. average_price should be rounded to 2 decimal places.

Return the result table in any order.

```
# Write your MySQL query statement below
select P.product_id, round(sum(P.price*U.units) / sum(U.units), 2) as average_price
from Prices P
inner join UnitsSold U
on P.product_id = U.product_id
where U.purchase_date between P.start_date and P.end_date
group by P.product_id
order by P.product_id
```

Write an SQL query to report the number of cubic feet of volume the inventory occupies in each warehouse.

Return the result table in any order.

```
# Write your MySQL query statement below
select W.name as warehouse_name, sum(P.Width * P.Length * P.Height * W.units) as volume
from Warehouse W
join Products P 
on P.product_id = W.product_id
group by W.name
```

Write an SQL query to report the difference between the number of apples and oranges sold each day.

Return the result table ordered by sale_date.

```
# Write your MySQL query statement below
select sale_date,
sum(case
    when fruit = 'apples' then sold_num
    when fruit = 'oranges' then -1 * sold_num
    end) as  diff

from Sales
group by sale_date
```

Write an SQL query to find for each month and country, the number of transactions and their total amount, the number of approved transactions and their total amount.

Return the result table in any order.

```
# Write your MySQL query statement below
select date_format(trans_date, "%Y-%m") as month, country, sum(amount) as trans_total_amount, count(id) as trans_count,
sum(case
    when state = 'approved' then 1 else 0 end) as approved_count,
    
sum(case
    when state = 'approved' then amount else 0 end) as approved_total_amount
    
from Transactions
group by date_format(trans_date, "%Y-%m"), country
```

Write an SQL query to find the percentage of the users registered in each contest rounded to two decimals.

Return the result table ordered by percentage in descending order. In case of a tie, order it by contest_id in ascending order.

```
# Write your MySQL query statement below
select contest_id, round((count(user_id) / (select count(user_id) from Users))*100, 2) as percentage
from Register
group by contest_id
order by percentage DESC, contest_id
```

If the customer's preferred delivery date is the same as the order date, then the order is called immediate; otherwise, it is called scheduled.

Write an SQL query to find the percentage of immediate orders in the table, rounded to 2 decimal places.

```
# Write your MySQL query statement below
select
round(sum(case
    when order_date = customer_pref_delivery_date then 1 else 0 end)
    /
    count(delivery_id)*100, 2)
    as immediate_percentage
    
from Delivery;
```

Write an SQL query to find each query_name, the quality and poor_query_percentage.

Both quality and poor_query_percentage should be rounded to 2 decimal places.

Return the result table in any order.

```
# Write your MySQL query statement below
select query_name, 
round(sum(rating / position) / count(result), 2) as quality,
round(sum(case when rating < 3 then 1 else 0 end)/count(result)*100, 2) as poor_query_percentage

from Queries
group by query_name
```

Write an SQL query to report the names of all sellers who did not make any sales in 2020.

Return the result table ordered by seller_name in ascending order.

```
# Write your MySQL query statement below

select seller_name from
(select s.seller_name as seller_name, 
sum(case
    when year(sale_date) = 2020 then 1 else 0 end)
    
as sale_count_2020 from Seller s
left join Orders o
on o.seller_id = s.seller_id
group by s.seller_name) temp
where sale_count_2020 = 0
order by seller_name
```

A single number is a number that appeared only once in the MyNumbers table.

Write an SQL query to report the largest single number. If there is no single number, report null.

```
# Write your MySQL query statement below

select max(num) as num from
(select num from MyNumbers
group by num having count(num) = 1) temp
```

Write a SQL query to find the highest grade with its corresponding course for each student. In case of a tie, you should find the course with the smallest course_id.

Return the result table ordered by student_id in ascending order.

```
# Write your MySQL query statement below
select student_id, min(course_id) as course_id, grade from Enrollments
where (student_id, grade) in

(select student_id,
max(grade) as grade
from Enrollments
group by student_id)

group by student_id
order by student_id
```

Write an SQL query to report the customer_id and customer_name of customers who bought products "A", "B" but did not buy the product "C" since we want to recommend them to purchase this product.

Return the result table ordered by customer_id.

```
select customer_id, customer_name from
(select c.customer_id, c.customer_name, group_concat(o.product_name order by o.product_name) as product_name
from Orders o
left join Customers c
on c.customer_id = o.customer_id
group by customer_id having product_name like 'A%' 
and product_name like '%B%' and 
product_name not like '%C%') as temp
```

Write an SQL query to evaluate the boolean expressions in Expressions table.

Return the result table in any order.

```
# Write your MySQL query statement below

select left_operand, operator, right_operand,
case
    when operator = '>' and left_value > right_value then 'true'
    when operator = '<' and left_value < right_value then 'true'
    when operator = '=' and left_value = right_value then 'true'
    else 'false' end as value
    
from

(select e.left_operand, v1.value as left_value, e.operator, e.right_operand, v2.value as right_value
from Expressions e
left join Variables v1 on v1.name = e.left_operand
left join Variables v2 on v2.name = e.right_operand) temp
```

Write an SQL query to recommend pages to the user with user_id = 1 using the pages that your friends liked. It should not recommend pages you already liked.

Return result table in any order without duplicates.

```
# Write your MySQL query statement below

select page_id as recommended_page from Likes

where user_id in

(select user2_id from Friendship
where user1_id = 1
union
select user1_id from Friendship
where user2_id = 1) 

and
page_id not in (select page_id from Likes where user_id = 1)

group by page_id
```

Write an SQL query to report the managers with at least five direct reports.

Return the result table in any order.

```
# Write your MySQL query statement below
select name from Employee

where id in

(select managerId
from Employee 
group by managerId having count(managerId) >= 5)
```

Write an SQL query to find the team size of each of the employees.

Return result table in any order.

```
select e.employee_id, temp.team_size
from Employee e
left join 

(select team_id, count(team_id) as team_size
from Employee
group by team_id) as temp

on
temp.team_id = e.team_id
```

Write an SQL query to find the number of times each student attended each exam.

Return the result table ordered by student_id and subject_name.

using from table1, table2

```
select temp.student_id, temp.student_name, temp.subject_name, count(e.subject_name) as attended_exams from
(select a.student_id, a.student_name, b.subject_name from
Students a, Subjects b
group by a.student_id, b.subject_name
order by a.student_id, b.subject_name) as temp

left join Examinations e on 
e.student_id = temp.student_id
and e.subject_name = temp.subject_name

group by temp.student_id, temp.subject_name
```

Using cross join

```
# Write your MySQL query statement below

select a.student_id, a.student_name, b.subject_name, count(e.subject_name) as attended_exams from

Students a
cross join Subjects b

left join Examinations e on 
e.student_id = a.student_id
and e.subject_name = b.subject_name

group by a.student_id, b.subject_name
order by a.student_id, b.subject_name

```

A telecommunications company wants to invest in new countries. The company intends to invest in the countries where the average call duration of the calls in this country is strictly greater than the global average call duration.

Write an SQL query to find the countries where this company can invest.

Return the result table in any order.

```
select temp.name as country from 

(select a.id,  c.name, ac.duration from Country c
left join Person a
on c.country_code = parsename(replace(a.phone_number, '-', '.'), 2)
left join Calls ac
on ac.callee_id = a.id

union


select a.id,  c.name, ac.duration from Country c
left join Person a
on c.country_code = parsename(replace(a.phone_number, '-', '.'), 2)
left join Calls ac
on ac.caller_id = a.id) temp

group by temp.name having avg(cast(temp.duration as float)) > (select avg(cast(duration as float)) from Calls)
```

Write an SQL query to find employees who have the highest salary in each of the departments.

Return the result table in any order.

```
# Write your MySQL query statement below

select d.name Department, e.name Employee, e.salary from
Department d
left join Employee e
on e.departmentId = d.id
where (d.id, e.salary) in 

(select departmentid, max(salary) as m
from employee
group by departmentid)
```

Write an SQL query to report the respective department name and number of students majoring in each department for all departments in the Department table (even ones with no current students).

Return the result table ordered by student_number in descending order. In case of a tie, order them by dept_name alphabetically.

```
# Write your MySQL query statement below
select d.dept_name, count(s.student_id) as student_number from Department d
left join Student s
on s.dept_id = d.dept_id
group by d.dept_name
order by count(s.student_id) DESC, d.dept_name
```

Write an SQL query to find the type of weather in each country for November 2019.

The type of weather is:

Cold if the average weather_state is less than or equal 15,
Hot if the average weather_state is greater than or equal to 25, and
Warm otherwise.
Return result table in any order.

```
# Write your MySQL query statement below
select c.country_name, 
case 
    when avg(weather_state) <= 15 then 'Cold'
    when avg(weather_state) >= 25 then 'Hot'
    else 'Warm' end as weather_type
    
from Countries c
left join Weather w
on w.country_id = c.country_id
where month(w.day) = 11 and year(w.day) = 2019
group by c.country_id
```

Partition by over order by (good Explaination)

```
with test (id, num, x) as (
  values 
    (1, 4, 1),
    (2, 4, 1),
    (3, 5, 2),
    (4, 6, 2)
)
select id, 
       num,
       x,
       count(*) over () as total_rows, 
       count(*) over (order by id) as rows_upto,
       count(*) over (partition by x order by id) as rows_per_x,
       sum(num) over (partition by x) as total_for_x,
       sum(num) over (order by id) as sum_upto,
       sum(num) over (partition by x order by id) as sum_for_x_upto
from test;
```

Write an SQL query to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by id in ascending order.

using row_number() and union
```
select row_number() over(order by NULL) as id, student from ((
# even part
    select id, row_number() over(order by NULL) as new_id, student from Seat
    where id % 2 = 0
)
union
                                                   
# odd part
    (select id, row_number() over(order by NULL) as new_id, student from seat
    where id % 2 != 0
)
order by new_id ASC, id DESC
```


using case
```
SELECT
    (CASE
        WHEN MOD(id, 2) != 0 AND counts != id THEN id + 1
        WHEN MOD(id, 2) != 0 AND counts = id THEN id
        ELSE id - 1
    END) AS id,
    student
FROM
    seat,
    (SELECT
        COUNT(*) AS counts
    FROM
        seat) AS seat_counts
ORDER BY id ASC;
```


using coalease

Write an SQL query to report the number of grand slam tournaments won by each player. Do not include the players who did not win any tournament.

Return the result table in any order.

```
select player_id, player_name, sum(total) as grand_slams_count from
(
select p.player_id, p.player_name, count(c.Wimbledon) as total
from Players p
left join Championships c
on c.Wimbledon = p.player_id
group by p.player_id

union all

select p.player_id, p.player_name, count(c.Fr_open) as total
from Players p
left join Championships c
on c.Fr_open = p.player_id
group by p.player_id

union all

select p.player_id, p.player_name, count(c.US_open) as total
from Players p
left join Championships c
on c.US_open = p.player_id
group by p.player_id

union all

select p.player_id, p.player_name, count(c.Au_open) as total
from Players p
left join Championships c
on c.Au_open = p.player_id
group by p.player_id
) as temp

group by player_name having grand_slams_count <> 0

```


Write an SQL query to find the prices of all products on 2019-08-16. Assume the price of all products before any change is 10.

Return the result table in any order.
```
# # Write your MySQL query statement below

with temp as
(select distinct product_id,
max(change_date) 
over(partition by product_id) as latest_date

from Products
where change_date <= '2019-08-16')


select temp.product_id, p.new_price as price from temp
join products p 
on P.product_id = temp.product_id and P.change_date = temp.latest_date

union

select distinct product_id, 10 as price from Products
where change_date > '2019-08-16' and product_id not in (select distinct product_id from Products where change_date <= '2019-08-16')
```

Write an SQL query to report all the consecutive available seats in the cinema.

Return the result table ordered by seat_id in ascending order.

```
# Write your MySQL query statement below
select distinct a.seat_id
from cinema a join cinema b
on abs(a.seat_id -b.seat_id) = 1 and a.free = 1 and b.free = 1
order by seat_id;
```

For this problem, we will consider a manager an employee who has at least 1 other employee reporting to them.

Write an SQL query to report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.

Return the result table ordered by employee_id.

```
# Write your MySQL query statement below
select a.employee_id, a.name, count(b.employee_id) as reports_count, round(avg(b.age), 0) as average_age
from Employees a
join Employees b 
on b.reports_to = a.employee_id
# where employee_id = reports_to
group by a.employee_id
order by a.employee_id
```

Write an SQL query to find the account_id of the accounts that should be banned from Leetflex. An account should be banned if it was logged in at some moment from two different IP addresses.

Return the result table in any order.

```
# Write your MySQL query statement below
select distinct a.account_id
from LogInfo a
join LogInfo b
on a.account_id = b.account_id and a.ip_address <> b.ip_address and a.login <= b.logout and a.logout >= b.login
```

Write an SQL query to find the employees who earn more than their managers.

Return the result table in any order.

```
# Write your MySQL query statement below
select b.name as Employee
from Employee a 
join Employee b
on b.managerId = a.id and b.salary > a.salary
```